import pytest
from palindroms import solve

@pytest.mark.parametrize("phrases, expected", [
    ([
        "нажал кабан на баклажан",
        "дом как комод",
        "рвал дед лавр",
        "азот калий и лактоза",
        "а собака боса",
        "тонет енот",
        "карман мрак",
        "пуст суп"
    ], [
        "нажал кабан на баклажан",
        "рвал дед лавр",
        "азот калий и лактоза",
        "а собака боса",
        "тонет енот",
        "пуст суп"
    ]),
    ([
        "дом как комод",
        "карман мрак"
    ], []),
    ([
        "тонет енот",
        "карман мрак",
        "пуст суп"
    ], [
        "тонет енот",
        "пуст суп"
    ])
])
def test_solve(phrases, expected):
    result = solve(phrases)
    assert result == expected
