import unittest
from cookbook import solve

class TestCookBook(unittest.TestCase):

    def setUp(self):
        self.cook_book = [
            ['Салат',
                [
                    ['картофель', 100, 'гр.'],
                    ['морковь', 50, 'гр.'],
                    ['огурцы', 50, 'гр.'],
                    ['горошек', 30, 'гр.'],
                    ['майонез', 70, 'мл.'],
                ]
            ],
            ['Пицца',
                [
                    ['сыр', 50, 'гр.'],
                    ['томаты', 50, 'гр.'],
                    ['тесто', 100, 'гр.'],
                    ['бекон', 30, 'гр.'],
                    ['колбаса', 30, 'гр.'],
                    ['грибы', 20, 'гр.'],
                ],
            ],
            ['Фруктовый десерт',
                [
                    ['хурма', 60, 'гр.'],
                    ['киви', 60, 'гр.'],
                    ['творог', 60, 'гр.'],
                    ['сахар', 10, 'гр.'],
                    ['мед', 50, 'мл.'],
                ]
            ]
        ]

    def test_solve_default_person(self):
        result = solve(self.cook_book)
        expected = [
            'Салат: картофель 500 гр., морковь 250 гр., огурцы 250 гр., горошек 150 гр., майонез 350 мл.',
            'Пицца: сыр 250 гр., томаты 250 гр., тесто 500 гр., бекон 150 гр., колбаса 150 гр., грибы 100 гр.',
            'Фруктовый десерт: хурма 300 гр., киви 300 гр., творог 300 гр., сахар 50 гр., мед 250 мл.'
        ]
        self.assertEqual(result, expected)

    def test_solve_one_person(self):
        result = solve(self.cook_book, person=1)
        expected = [
            'Салат: картофель 100 гр., морковь 50 гр., огурцы 50 гр., горошек 30 гр., майонез 70 мл.',
            'Пицца: сыр 50 гр., томаты 50 гр., тесто 100 гр., бекон 30 гр., колбаса 30 гр., грибы 20 гр.',
            'Фруктовый десерт: хурма 60 гр., киви 60 гр., творог 60 гр., сахар 10 гр., мед 50 мл.'
        ]
        self.assertEqual(result, expected)

    def test_solve_custom_person(self):
        result = solve(self.cook_book, person=3)
        expected = [
            'Салат: картофель 300 гр., морковь 150 гр., огурцы 150 гр., горошек 90 гр., майонез 210 мл.',
            'Пицца: сыр 150 гр., томаты 150 гр., тесто 300 гр., бекон 90 гр., колбаса 90 гр., грибы 60 гр.',
            'Фруктовый десерт: хурма 180 гр., киви 180 гр., творог 180 гр., сахар 30 гр., мед 150 мл.'
        ]
        self.assertEqual(result, expected)

if __name__ == '__main__':
    unittest.main()
